IDEA Open Model
SectionStiffnesses Properties
Compatible with IDEA StatiCa Beta 20.0
The SectionStiffnesses type exposes the following members.
Properties
Name | Description
Alfa
 rotation around x-axis
EAx
 axial stiffness
EccX
 eccentricity in x-direction
EccY
 eccentricity in y-direction
EccZ
 eccentricity in y-direction
EDyz
 product moment stiffness
EIy
 bending stiffness
EIz
 bending stiffness
GAy
 shear stiffness
GAz
 shear stiffness
GIx
 torsion stiffness
Top
See Also
Reference
SectionStiffnesses Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace